## Introductionn to Pandas

In [1]:
import pandas as pd

## Creating a series

In [5]:
tempratures=[20,34,11,24,15,89]
temp_series=pd.Series(tempratures)
print(temp_series)

0    20
1    34
2    11
3    24
4    15
5    89
dtype: int64

## Custom Indexing

In [7]:
days=["Monday","Tuesday","Wednesday","Thursday","Friday","Saturday"]
temp_ondays=pd.Series(tempratures,index=days)
temp_ondays

Monday       20
Tuesday      34
Wednesday    11
Thursday     24
Friday       15
Saturday     89
dtype: int64

## Series from Dictionary

In [10]:
fruits={'Apple':20,'Orange':11,'Peach':33,'Bannana':10}
fruit_series=pd.Series(fruits)
fruit_series

Apple      20
Orange     11
Peach      33
Bannana    10
dtype: int64

## Series from numpy array

In [12]:
import numpy as np
rand_num=np.random.rand(8)
rand_series=pd.Series(rand_num)
rand_series

0    0.190008
1    0.450056
2    0.558878
3    0.464804
4    0.024951
5    0.487684
6    0.425798
7    0.683001
dtype: float64

## Creating a Dataframe

In [14]:
data={
    'Names':["ayush","arnav","shukla","ponting"],
    'age':[20,33,42,53],
    'country':["ind","ind","usa","china"]
}
df=pd.DataFrame(data)
df

     Names  age country
0    ayush   20     ind
1    arnav   33     ind
2   shukla   42     usa
3  ponting   53   china

In [16]:
array_data=np.array([[1,2,4,5],[3,22,33,11],[21,31,44,3]])
colums=np.array(["weidth","height","length","Girth"])
df=pd.DataFrame(array_data,columns=colums)
df

   weidth  height  length  Girth
0       1       2       4      5
1       3      22      33     11
2      21      31      44      3

## Combinig series into Data Frame

In [24]:
apple_stock=pd.Series([120,230,150],index=['2021','2022','2023'])
orange_stock=pd.Series([33,38,56],index=['2021','2022','2023'])
df_2=pd.DataFrame({'Apple':apple_stock,'orange':orange_stock})
df_2

      Apple  orange
2021    120      33
2022    230      38
2023    150      56

In [25]:
df_2['lost yield']=[2,4,5]
df_2

      Apple  orange  lost yield
2021    120      33           2
2022    230      38           4
2023    150      56           5

In [ ]:
df_2=df_2.drop('lost yield',axis=1)